Repository: sabeeralikp/htr_application
Catalog: lib/l10n/app_*.arb
Languages: ml

# home_body_title
source: UPLOAD FILE
ml: ഫയൽ അപ്‌ലോഡ് ചെയ്യുക

# home_main_title1
source: Empowering Efficient
ml: കാര്യക്ഷമമായ ഡോക്യുമെന്റ്

# home_main_title2
source: Document Digitalisation
ml: ഡിജിറ്റലൈസേഷൻ

# home_sub_title
source: An open source solution to effortlessly convert printed and handwritten Malyalam content into editable text, Transform your documents with ease.
ml: മലയാളഭാഷയിൽ അച്ചടിച്ച / കൈയെഴുത്ത് പതിപ്പുകളെ യന്ത്ര സഹായത്തോടെ എഡിറ്റ് ചെയ്യാവുന്ന ഫോർമാറ്റിലേക്ക് മാറ്റുന്നതിനുള്ള ഒരു ഓപ്പൺ സോഴ്സ് സോഫ്റ്റ്‌വെയർ.

# home_button_1
source: Download Solution
ml: സോഫ്റ്റ്‌വെയർ ഡൗൺലോഡ് ചെയ്യുക

# home_button_2
source: Try Now
ml: ട്രൈ ചെയ്യുക

# home_sub_heading
source: What we offer
ml: ഞങ്ങൾ എന്താണ് നൽകുന്നത്

# home_sub_description
source: Unlimited access, transparent and open. Dhriti provides a easy text extraction tool exclusively for malayalam
ml: സുതാര്യവും സ്വതന്ത്രവുമായ പരിധിയില്ലാത്ത അക്സസ്സ് . മലയാളത്തിനു മാത്രമായിട്ടുള്ള ഒരു ടെക്സ്റ്റ് എക്സ്ട്രാക്ഷൻ ടൂൾ ആണ് 'ധൃതി' സംഭാവന ചെയ്യുന്നത്.

# feature_title_1
source: Open Source
ml: ഓപ്പൺ സോഴ്സ്

# feature_title_desc_1
source: The tool free to use and open to contribute.
ml: ടൂൾ സൗജന്യമായി ഉപയോഗിക്കാവുന്നതും അതിലേക്ക് സംഭാവനകൾ ചെയ്യാവുന്നതുമാണ്.

# feature_title_2
source: Text Extraction
ml: ടെക്സ്റ്റ് എക്സ്ട്രാക്ഷൻ

# feature_title_desc_2
source: Instantly extract Malayalam text from documents and images.
ml: ഡോക്യൂമെന്റുകളിൽ നിന്നും ചിത്രങ്ങളിൽ നിന്നും വേഗത്തിൽ മലയാളം വേർതിരിച്ചെടുക്കാൻ കഴിയും.

# feature_title_3
source: Editable Output
ml: എഡിറ്റ് ചെയ്യാവുന്ന ഔട്ട്പുട്ട്

# feature_title_desc_3
source: Easily edit the extracted text within the tool's interface.
ml: എക്സ്ട്രാക്ട് ചെയ്‌ത വാചകം ടൂളിനുള്ളിൽ എളുപ്പത്തിൽ എഡിറ്റ് ചെയ്യാനാകും.

# feature_title_4
source: Export Feature
ml: എക്സ്പോർട്ട് ഫീച്ചർ

# feature_title_desc_4
source: Seamlessly export the extracted and edited Malayalam text
ml: എഡിറ്റ് ചെയ്ത മലയാളം ടെക്സ്റ്റ് തടസ്സമില്ലാതെ എക്‌സ്‌പോർട്ട് ചെയ്യാൻ കഴിയും

# home_head_below_1
source: We're not just shaping software
ml: ഞങ്ങൾ സോഫ്റ്റ്‌വെയർ മാത്രമല്ല,

# home_head_below_2
source: We're shaping the future.
ml: ഭാവിയെക്കൂടിയാണ് നിർമ്മിക്കുന്നത്.

# home_below_description
source: Dhriti is an open source tool crafted by Language Technology team at ICFOSS (International Centre for Free and Open Source Solutions), we embody the spirit of open source innovation and collaboration. Established as a pioneering institution, we are fervently dedicated to driving the widespread adoption of open-source technology. Our journey is one of fostering positive change through technology. Rooted in the principles of openness, transparency, and community, ICFOSS is a hub for individuals and organizations passionate about the transformative power of open source.
ml: അന്താരാഷ്ട്ര സ്വതന്ത്രവിജ്ഞാന ഗവേഷണ വികസനകേന്ദ്രം (ഐസിഫോസ്) ഓപ്പൺ സോഴ്സ് സാങ്കേതികവിദ്യയുടെ വ്യാപകമായ സ്വീകാര്യത വർദ്ധിപ്പിക്കുന്നതിൽ പ്രതിജ്ഞാബദ്ധരാണ്. സാങ്കേതികവിദ്യയിലൂടെ ക്രിയാത്മകമായ മാറ്റം വരുത്താനാണ് ഞങ്ങൾ ശ്രമിച്ചുകൊണ്ടിരിക്കുന്നത്. സ്വാതന്ത്ര്യം, സുതാര്യത, കമ്മ്യൂണിറ്റി എന്നീ തത്വങ്ങളിൽ വേരൂന്നി ഓപ്പൺ സോഴ്സിന്റെ പരിണാമശക്തിയിൽ അഭിനിവേശമുള്ള വ്യക്തികളുടെയും സംഘടനകളുടെയും കേന്ദ്രമാണ് ഐസിഫോസ്.

# home_below_button
source: Learn More
ml: കൂടുതൽ അറിയുക

# document_upload_heading
source: Select your document type
ml: നിങ്ങളുടെ ഡോക്യുമെന്റ് ഫോർമാറ്റ് തിരഞ്ഞെടുക്കുക

# document_upload_subheading
source: Choose the desired document type from the options below to extract text using Dhriti OCR.
ml: ധ്രുതി ഒസിആർ ഉപയോഗിച്ച് ടെക്സ്റ്റ് എക്സ്ട്രാക്റ്റ് ചെയ്യുന്നതിന് ചുവടെയുള്ള ഓപ്ഷനുകളിൽ നിന്ന് ആവശ്യമുള്ള ഡോക്യുമെന്റ് തരം തിരഞ്ഞെടുക്കുക.

# handwritten_segment_type_subheading
source: Also specify the segment type as automatic or manual.
ml: സെഗ്മെന്റ് തരം ഓട്ടോമാറ്റിക് അല്ലെങ്കിൽ മാനുവൽ ആയി വ്യക്തമാക്കുക.

# feature_menu_printed
source: Printed
ml: പ്രിന്റഡ്

# feature_menu_printed_description
source: Capture Malayalam and English text from books, articles, and more
ml: പുസ്തകങ്ങൾ, ലേഖനങ്ങളിൽ നിന്നും മറ്റും മലയാളവും ഇംഗ്ലീഷും പകർത്തി നൽകുന്നു

# feature_menu_handwritten
source: Handwritten
ml: ഹാൻഡ്‌റിട്ടേൺ

# feature_menu_handwritten_description
source: Transform your Malayalam handwritten notes, letters, and more
ml: നിങ്ങളുടെ കൈയെഴുത്ത് കുറിപ്പുകളും, കത്തുകളും അതിലേറെയും രൂപാന്തരപ്പെടുത്തുന്നു

# elevated_button_ext
source: Extract
ml: എക്സ്ട്രാക്റ്റ്

# android_install
source: Installation Instructions:
ml: ഇൻസ്റ്റാളേഷൻ നിർദ്ദേശങ്ങൾ:

# android_install_1
source: 1. After downloading, Go to Settings > Security
ml: 1. ഡൗൺലോഡ് ചെയ്ത ശേഷം, Settings > Security എന്നതിലേക്ക് പോകുക

# android_install_2
source: 2. Enable the Unknown sources option to allow installation from sources other than the Play Store.
ml: 2. പ്ലേ സ്റ്റോർ ഒഴികെയുള്ള ഉറവിടങ്ങളിൽ നിന്ന് ഇൻസ്റ്റാളേഷൻ അനുവദിക്കുന്നതിന് തിരിച്ചറിയാനാകാത്ത ഉറവിട ഓപ്ഷൻ പ്രവർത്തനക്ഷമമാക്കുക.

# android_install_3
source: 3. Open the file manager and navigate to the downloaded APK file.
ml: 3. ഫയൽ മാനേജർ തുറന്ന് ഡൗൺലോഡ് ചെയ്ത APK ഫയലിലേക്ക് നാവിഗേറ്റ് ചെയ്യുക.

# android_install_4
source: 4. Tap on the APK file to begin the installation process.
ml: 4. ഇൻസ്റ്റാളേഷൻ പ്രക്രിയ ആരംഭിക്കുന്നതിന് APK ഫയലിൽ ടാപ്പുചെയ്യുക.

# android_install_5
source: 5. Follow the on-screen prompts to complete the installation.
ml: 5. ഇൻസ്റ്റാളേഷൻ പൂർത്തിയാക്കുന്നതിന് ഓൺ-സ്ക്രീൻ പ്രോംപ്റ്റുകൾ പിന്തുടരുക.

# android_install_6
source: 6. Once installed, you can find and use the app from your device's app drawer.
ml: 6. ഇൻസ്റ്റാൾ ചെയ്തുകഴിഞ്ഞാൽ, നിങ്ങളുടെ ഉപകരണത്തിന്റെ അപ്ലിക്കേഷൻ ഡ്രോയറിൽ നിന്ന് നിങ്ങൾക്ക് അപ്ലിക്കേഷൻ കണ്ടെത്താനും ഉപയോഗിക്കാനും കഴിയും.

# linux_install
source: Installation Instrunctions:
ml: ഇൻസ്റ്റാളേഷൻ നിർദ്ദേശങ്ങൾ:

# linux_install_1
source: 1. After downloading, Open terminal.
ml: 1. ഡൗൺലോഡ് ചെയ്ത ശേഷം ടെർമിനൽ തുറക്കുക.

# linux_install_2
source: 2. Navigate to the directory containing the downloaded DEB file
ml: 2. ഡൗൺലോഡ് ചെയ്ത DEB ഫയൽ അടങ്ങിയ ഡയറക്ടറിയിലേക്ക് നാവിഗേറ്റ് ചെയ്യുക.

# linux_install_3
source: 3. Run 'sudo dpkg -i malayalam_ocr_app.deb'
ml: 3. റൺ 'sudo dpkg -i malayalam_ocr_app.deb'

# platform_item_android
source: Android
ml: ആൻഡ്രോയിഡ്

# platform_item_linux
source: Linux
ml: ലിനക്സ്

# platform_item_ios
source: iOS
ml: ഐ ഒഎസ്

# platform_item_windows
source: Windows
ml: വിൻഡോസ്

# platform_item_macos
source: MacOS
ml: മാക് ഒഎസ്

# platform_heading
source: Select the platform of your choice
ml: നിങ്ങൾക്ക് ഇഷ്ടമുള്ള പ്ലാറ്റ്ഫോം തിരഞ്ഞെടുക്കുക

# platform_subheading
source: Choose the device of your preference from the platforms below to ensure that you always have Dhriti OCR at your fingertips
ml: നിങ്ങളുടെ വിരൽത്തുമ്പിൽ എല്ലായ്പ്പോഴും ധൃതി ഒസിആർ ഉണ്ടെന്ന് ഉറപ്പാക്കാൻ ചുവടെയുള്ള പ്ലാറ്റ്ഫോമുകളിൽ നിന്ന് നിങ്ങൾക്ക് ഇഷ്ടമുള്ള ഉപകരണം തിരഞ്ഞെടുക്കുക

# copy_button
source: Copy All
ml: എല്ലാം പകർത്തുക

# home_body_description
source: Upload your pdf or image
ml: നിങ്ങളുടെ പി.ഡി.ഫ് അല്ലെങ്കിൽ ചിത്രം അപ്‌ലോഡ് ചെയ്യുക

# upload_fab
source: Upload
ml: അപ്‌ലോഡ്

# file_uploaded_title
source: Choose Segmentation Method
ml: വിഭജിക്കാൻ ഉള്ള രീതി തിരഞ്ഞെടുക്കുക

# segmentation_button_manual
source: Manual
ml: മാനുവൽ

# segmentation_button_auto
source: Automatic
ml: ഓട്ടോമാറ്റിക്

# segmentation_button_cont
source: Continue
ml: തുടരുക

# copy_to_clipboard_success_message
source: The text has been copied to clipboard
ml: വാചകം ക്ലിപ്പ്ബോർഡിലേക്ക് പകർത്തിയിരിക്കുന്നു

# appbar_title
source: Segment
ml: വിഭജനും

# text_button_selectall
source: Select All
ml: എല്ലാം തിരഞ്ഞെടുക്കുക

# elevated_button_next
source: Next
ml: അടുത്തത്

# feedback_title
source: Have a minute to spare ?
ml: അഭിപ്രായം രേഖപ്പെടുത്തുക

# feedback_body
source: Are you happy with the app ?
ml: ആപ്പിൽ നിങ്ങൾ സന്തുഷ്ടനാണോ?

# rating_title
source: Your message to developer
ml: ഡെവലപ്പർക്കുള്ള നിങ്ങളുടെ സന്ദേശം

# rating_button_send
source: send
ml: അയയ്ക്കുക

# appbar_result
source: Result
ml: ഫലം

# title_export
source: Export As
ml: പരിവർത്തനം ചെയ്യുക

# appbar_export
source: Export As
ml: പരിവർത്തനം ചെയ്യുക

# save_the_doc
source: Save the document as
ml: രേഖ ഇപ്രകാരം സൂക്ഷിക്കുക

# text_button_cancel
source: Cancel
ml: ഉപേക്ഷിക്കുക

# text_button_export
source: Export
ml: പരിവർത്തനം ചെയ്യുക

# snack_location
source: The File has been downloaded and saved to {downloadLocation}
ml: ഫയൽ ഡൗൺലോഡ് ചെയ്യുകയും ഇവിടെ സൂക്ഷിക്കുകയും ചെയ്തിരിക്കുന്നു {downloadLocation}

# snack_action
source: Open
ml: തുറക്കുക

# sheet_components_adjust
source: Adjust Threshold
ml: പരിധി ക്രമീകരിക്കുക

# sheet_components_threshold_value
source: Threshold Value
ml: പരിധി മൂല്യം നിർണയിക്കുക

# sheet_components_horizontal_spacing
source: Horizontal Spacing
ml: തിരശ്ചീന അകലം

# sheet_components_vertical_spacing
source: Vertical Spacing
ml: ലംബതലത്തിലുള്ള അകലം

# eleveted_button_threshold
source: Threshold
ml: തുടരുക
